Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter
The static Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter class contains methods for getting correctly formatted texts
and values of formatted texts.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.TryGetValue(System.String,System.Double@)
Tries to get the double value for a formatted string.
value: The formatted string.
result: The formatted string as a double value.
Returns: True on success. False on failure.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.TryGetValue(System.String,Tekla.BIM.DirectManipulation.Services.Controls.ValueControlType,System.Double@)
Tries to get the double value for a formatted string.
value: The formatted string.
valueType: The value type.
result: The formatted string as a double value.
Returns: True on success. False on failure.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.TryGetValues(System.String,Tekla.BIM.DirectManipulation.Services.Controls.ValueControlType,System.Collections.Generic.IList{System.Double}@)
Tries the get the double values for a formatted string.
value: The formatted string.
valueType: The value type.
result: The formatted string as a list of double values.
Returns: True on success. False on failure.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetText(System.Double)
Gets the correctly formatted text to show in the user interface.
value: The double value.
Returns: The text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetText(System.Double,Tekla.BIM.DirectManipulation.Services.Controls.ValueControlType)
Gets the correctly formatted text to show in the user interface.
value: The double value.
valueType: The value type.
Returns: The text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetText(System.Collections.Generic.IEnumerable{System.Double},Tekla.BIM.DirectManipulation.Services.Controls.ValueControlType)
Gets the correctly formatted text to show in the user interface.
values: The double values.
valueType: The value type.
Returns: The text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.IsDegreesAngleUnit
Checks if angle is in degrees.
Returns: True if angle is in degrees units, false when radians.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.TryGetDistanceValues(System.String,System.Collections.Generic.IList{System.Double}@)
Tries to get the double values for a distance string.
distances: The distance string.
result: The distance string as a list of double values.
Returns: True on success. False on failure.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetDistanceText(System.Collections.Generic.IEnumerable{System.Double})
Gets the correctly formatted distance text to show in the user interface.
distances: The collection of distances as double values.
Returns: The distance text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.TryGetAngleValues(System.String,System.Collections.Generic.IList{System.Double}@)
Tries to get the double values for an angle string.
angles: The angle string.
result: The angle string as a list of double values.
Returns: True on success. False on failure.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetAngleText(System.Collections.Generic.IEnumerable{System.Double},Tekla.Structures.Application.Contracts.ModelingUnitsAndDecimalsInfo.AngleUnits)
Gets the correctly formatted angle text to show in the user interface.
angles: The collection of angles as double values.
angleUnit: Unit type of the angle.
Returns: The angle text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetAngleText(System.Collections.Generic.IEnumerable{System.Double})
Gets the correctly formatted angle text to show in the user interface.
angles: The collection of angles as double values.
Returns: The angle text to show in the user interface.

Tekla.Structures.DirectManipulation.Adapter.Controls.ValueFormatter.GetAngleUnit
Gets the angle unit.
Returns: The angle unit.